{"class_name": "Model", "backend": "tensorflow", "config": {"layers": [{"class_name": "InputLayer", "config": {"sparse": false, "dtype": "float32", "name": "input_11", "batch_input_shape": [null, 28, 28, 1]}, "name": "input_11", "inbound_nodes": []}, {"class_name": "Conv2D", "config": {"activation": "relu", "kernel_regularizer": null, "data_format": "channels_last", "name": "conv2d_31", "kernel_constraint": null, "kernel_size": [3, 3], "strides": [1, 1], "activity_regularizer": null, "use_bias": true, "bias_regularizer": null, "trainable": true, "dilation_rate": [1, 1], "padding": "same", "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 16, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}}, "name": "conv2d_31", "inbound_nodes": [[["input_11", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "pool_size": [2, 2], "data_format": "channels_last", "name": "max_pooling2d_16", "trainable": true, "padding": "same"}, "name": "max_pooling2d_16", "inbound_nodes": [[["conv2d_31", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"activation": "relu", "kernel_regularizer": null, "data_format": "channels_last", "name": "conv2d_32", "kernel_constraint": null, "kernel_size": [3, 3], "strides": [1, 1], "activity_regularizer": null, "use_bias": true, "bias_regularizer": null, "trainable": true, "dilation_rate": [1, 1], "padding": "same", "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 8, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}}, "name": "conv2d_32", "inbound_nodes": [[["max_pooling2d_16", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "pool_size": [2, 2], "data_format": "channels_last", "name": "max_pooling2d_17", "trainable": true, "padding": "same"}, "name": "max_pooling2d_17", "inbound_nodes": [[["conv2d_32", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"activation": "relu", "kernel_regularizer": null, "data_format": "channels_last", "name": "conv2d_33", "kernel_constraint": null, "kernel_size": [3, 3], "strides": [1, 1], "activity_regularizer": null, "use_bias": true, "bias_regularizer": null, "trainable": true, "dilation_rate": [1, 1], "padding": "same", "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 4, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}}, "name": "conv2d_33", "inbound_nodes": [[["max_pooling2d_17", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "pool_size": [2, 2], "data_format": "channels_last", "name": "max_pooling2d_18", "trainable": true, "padding": "same"}, "name": "max_pooling2d_18", "inbound_nodes": [[["conv2d_33", 0, 0, {}]]]}, {"class_name": "UpSampling2D", "config": {"size": [2, 2], "data_format": "channels_last", "name": "up_sampling2d_16", "trainable": true}, "name": "up_sampling2d_16", "inbound_nodes": [[["max_pooling2d_18", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"activation": "relu", "kernel_regularizer": null, "data_format": "channels_last", "name": "conv2d_34", "kernel_constraint": null, "kernel_size": [3, 3], "strides": [1, 1], "activity_regularizer": null, "use_bias": true, "bias_regularizer": null, "trainable": true, "dilation_rate": [1, 1], "padding": "same", "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 4, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}}, "name": "conv2d_34", "inbound_nodes": [[["up_sampling2d_16", 0, 0, {}]]]}, {"class_name": "UpSampling2D", "config": {"size": [2, 2], "data_format": "channels_last", "name": "up_sampling2d_17", "trainable": true}, "name": "up_sampling2d_17", "inbound_nodes": [[["conv2d_34", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"activation": "relu", "kernel_regularizer": null, "data_format": "channels_last", "name": "conv2d_35", "kernel_constraint": null, "kernel_size": [3, 3], "strides": [1, 1], "activity_regularizer": null, "use_bias": true, "bias_regularizer": null, "trainable": true, "dilation_rate": [1, 1], "padding": "valid", "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 8, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}}, "name": "conv2d_35", "inbound_nodes": [[["up_sampling2d_17", 0, 0, {}]]]}, {"class_name": "UpSampling2D", "config": {"size": [2, 2], "data_format": "channels_last", "name": "up_sampling2d_18", "trainable": true}, "name": "up_sampling2d_18", "inbound_nodes": [[["conv2d_35", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"activation": "relu", "kernel_regularizer": null, "data_format": "channels_last", "name": "conv2d_36", "kernel_constraint": null, "kernel_size": [3, 3], "strides": [1, 1], "activity_regularizer": null, "use_bias": true, "bias_regularizer": null, "trainable": true, "dilation_rate": [1, 1], "padding": "same", "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 16, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}}, "name": "conv2d_36", "inbound_nodes": [[["up_sampling2d_18", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"activation": "sigmoid", "kernel_regularizer": null, "data_format": "channels_last", "name": "decoder_output", "kernel_constraint": null, "kernel_size": [5, 5], "strides": [1, 1], "activity_regularizer": null, "use_bias": true, "bias_regularizer": null, "trainable": true, "dilation_rate": [1, 1], "padding": "same", "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 1, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}}, "name": "decoder_output", "inbound_nodes": [[["conv2d_36", 0, 0, {}]]]}], "input_layers": [["input_11", 0, 0]], "name": "model_15", "output_layers": [["decoder_output", 0, 0]]}, "keras_version": "2.0.8"}