{"keras_version": "2.0.8", "config": {"input_layers": [["input_51", 0, 0]], "name": "model_46", "output_layers": [["dense_176", 0, 0]], "layers": [{"config": {"batch_input_shape": [null, 64], "dtype": "float32", "name": "input_51", "sparse": false}, "class_name": "InputLayer", "name": "input_51", "inbound_nodes": []}, {"config": {"name": "dense_174", "kernel_constraint": null, "kernel_regularizer": null, "activation": "relu", "bias_constraint": null, "use_bias": true, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 256, "bias_regularizer": null, "activity_regularizer": null}, "class_name": "Dense", "name": "dense_174", "inbound_nodes": [[["input_51", 0, 0, {}]]]}, {"config": {"name": "dense_175", "kernel_constraint": null, "kernel_regularizer": null, "activation": "relu", "bias_constraint": null, "use_bias": true, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 256, "bias_regularizer": null, "activity_regularizer": null}, "class_name": "Dense", "name": "dense_175", "inbound_nodes": [[["dense_174", 0, 0, {}]]]}, {"config": {"name": "dense_176", "kernel_constraint": null, "kernel_regularizer": null, "activation": "sigmoid", "bias_constraint": null, "use_bias": true, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 1, "bias_regularizer": null, "activity_regularizer": null}, "class_name": "Dense", "name": "dense_176", "inbound_nodes": [[["dense_175", 0, 0, {}]]]}]}, "class_name": "Model", "backend": "tensorflow"}