{"keras_version": "2.0.8", "config": {"input_layers": [["input_52", 0, 0]], "name": "model_45", "output_layers": [["dense_173", 0, 0]], "layers": [{"config": {"batch_input_shape": [null, 100], "dtype": "float32", "name": "input_52", "sparse": false}, "class_name": "InputLayer", "name": "input_52", "inbound_nodes": []}, {"config": {"name": "dense_171", "kernel_constraint": null, "kernel_regularizer": null, "activation": "relu", "bias_constraint": null, "use_bias": true, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 256, "bias_regularizer": null, "activity_regularizer": null}, "class_name": "Dense", "name": "dense_171", "inbound_nodes": [[["input_52", 0, 0, {}]]]}, {"config": {"name": "dense_172", "kernel_constraint": null, "kernel_regularizer": null, "activation": "relu", "bias_constraint": null, "use_bias": true, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 256, "bias_regularizer": null, "activity_regularizer": null}, "class_name": "Dense", "name": "dense_172", "inbound_nodes": [[["dense_171", 0, 0, {}]]]}, {"config": {"name": "dense_173", "kernel_constraint": null, "kernel_regularizer": null, "activation": "custom_activation", "bias_constraint": null, "use_bias": true, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 64, "bias_regularizer": null, "activity_regularizer": null}, "class_name": "Dense", "name": "dense_173", "inbound_nodes": [[["dense_172", 0, 0, {}]]]}]}, "class_name": "Model", "backend": "tensorflow"}